----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 48, 224, 224]           1,296
 OverlapPatchEmbed-2         [-1, 48, 224, 224]               0
WithBias_LayerNorm-3            [-1, 50176, 48]              96
         LayerNorm-4         [-1, 48, 224, 224]               0
            Conv2d-5        [-1, 144, 224, 224]           6,912
            Conv2d-6        [-1, 144, 224, 224]           1,296
            Conv2d-7         [-1, 48, 224, 224]           2,304
         Attention-8         [-1, 48, 224, 224]               0
WithBias_LayerNorm-9            [-1, 50176, 48]              96
        LayerNorm-10         [-1, 48, 224, 224]               0
           Conv2d-11        [-1, 254, 224, 224]          12,192
           Conv2d-12        [-1, 254, 224, 224]           2,286
           Conv2d-13         [-1, 48, 224, 224]           6,096
      FeedForward-14         [-1, 48, 224, 224]               0
 TransformerBlock-15         [-1, 48, 224, 224]               0
WithBias_LayerNorm-16            [-1, 50176, 48]              96
        LayerNorm-17         [-1, 48, 224, 224]               0
           Conv2d-18        [-1, 144, 224, 224]           6,912
           Conv2d-19        [-1, 144, 224, 224]           1,296
           Conv2d-20         [-1, 48, 224, 224]           2,304
        Attention-21         [-1, 48, 224, 224]               0
WithBias_LayerNorm-22            [-1, 50176, 48]              96
        LayerNorm-23         [-1, 48, 224, 224]               0
           Conv2d-24        [-1, 254, 224, 224]          12,192
           Conv2d-25        [-1, 254, 224, 224]           2,286
           Conv2d-26         [-1, 48, 224, 224]           6,096
      FeedForward-27         [-1, 48, 224, 224]               0
 TransformerBlock-28         [-1, 48, 224, 224]               0
WithBias_LayerNorm-29            [-1, 50176, 48]              96
        LayerNorm-30         [-1, 48, 224, 224]               0
           Conv2d-31        [-1, 144, 224, 224]           6,912
           Conv2d-32        [-1, 144, 224, 224]           1,296
           Conv2d-33         [-1, 48, 224, 224]           2,304
        Attention-34         [-1, 48, 224, 224]               0
WithBias_LayerNorm-35            [-1, 50176, 48]              96
        LayerNorm-36         [-1, 48, 224, 224]               0
           Conv2d-37        [-1, 254, 224, 224]          12,192
           Conv2d-38        [-1, 254, 224, 224]           2,286
           Conv2d-39         [-1, 48, 224, 224]           6,096
      FeedForward-40         [-1, 48, 224, 224]               0
 TransformerBlock-41         [-1, 48, 224, 224]               0
WithBias_LayerNorm-42            [-1, 50176, 48]              96
        LayerNorm-43         [-1, 48, 224, 224]               0
           Conv2d-44        [-1, 144, 224, 224]           6,912
           Conv2d-45        [-1, 144, 224, 224]           1,296
           Conv2d-46         [-1, 48, 224, 224]           2,304
        Attention-47         [-1, 48, 224, 224]               0
WithBias_LayerNorm-48            [-1, 50176, 48]              96
        LayerNorm-49         [-1, 48, 224, 224]               0
           Conv2d-50        [-1, 254, 224, 224]          12,192
           Conv2d-51        [-1, 254, 224, 224]           2,286
           Conv2d-52         [-1, 48, 224, 224]           6,096
      FeedForward-53         [-1, 48, 224, 224]               0
 TransformerBlock-54         [-1, 48, 224, 224]               0
           Conv2d-55         [-1, 24, 224, 224]          10,368
   PixelUnshuffle-56         [-1, 96, 112, 112]               0
       Downsample-57         [-1, 96, 112, 112]               0
WithBias_LayerNorm-58            [-1, 12544, 96]             192
        LayerNorm-59         [-1, 96, 112, 112]               0
           Conv2d-60        [-1, 288, 112, 112]          27,648
           Conv2d-61        [-1, 288, 112, 112]           2,592
           Conv2d-62         [-1, 96, 112, 112]           9,216
        Attention-63         [-1, 96, 112, 112]               0
WithBias_LayerNorm-64            [-1, 12544, 96]             192
        LayerNorm-65         [-1, 96, 112, 112]               0
           Conv2d-66        [-1, 510, 112, 112]          48,960
           Conv2d-67        [-1, 510, 112, 112]           4,590
           Conv2d-68         [-1, 96, 112, 112]          24,480
      FeedForward-69         [-1, 96, 112, 112]               0
 TransformerBlock-70         [-1, 96, 112, 112]               0
WithBias_LayerNorm-71            [-1, 12544, 96]             192
        LayerNorm-72         [-1, 96, 112, 112]               0
           Conv2d-73        [-1, 288, 112, 112]          27,648
           Conv2d-74        [-1, 288, 112, 112]           2,592
           Conv2d-75         [-1, 96, 112, 112]           9,216
        Attention-76         [-1, 96, 112, 112]               0
WithBias_LayerNorm-77            [-1, 12544, 96]             192
        LayerNorm-78         [-1, 96, 112, 112]               0
           Conv2d-79        [-1, 510, 112, 112]          48,960
           Conv2d-80        [-1, 510, 112, 112]           4,590
           Conv2d-81         [-1, 96, 112, 112]          24,480
      FeedForward-82         [-1, 96, 112, 112]               0
 TransformerBlock-83         [-1, 96, 112, 112]               0
WithBias_LayerNorm-84            [-1, 12544, 96]             192
        LayerNorm-85         [-1, 96, 112, 112]               0
           Conv2d-86        [-1, 288, 112, 112]          27,648
           Conv2d-87        [-1, 288, 112, 112]           2,592
           Conv2d-88         [-1, 96, 112, 112]           9,216
        Attention-89         [-1, 96, 112, 112]               0
WithBias_LayerNorm-90            [-1, 12544, 96]             192
        LayerNorm-91         [-1, 96, 112, 112]               0
           Conv2d-92        [-1, 510, 112, 112]          48,960
           Conv2d-93        [-1, 510, 112, 112]           4,590
           Conv2d-94         [-1, 96, 112, 112]          24,480
      FeedForward-95         [-1, 96, 112, 112]               0
 TransformerBlock-96         [-1, 96, 112, 112]               0
WithBias_LayerNorm-97            [-1, 12544, 96]             192
        LayerNorm-98         [-1, 96, 112, 112]               0
           Conv2d-99        [-1, 288, 112, 112]          27,648
          Conv2d-100        [-1, 288, 112, 112]           2,592
          Conv2d-101         [-1, 96, 112, 112]           9,216
       Attention-102         [-1, 96, 112, 112]               0
WithBias_LayerNorm-103            [-1, 12544, 96]             192
       LayerNorm-104         [-1, 96, 112, 112]               0
          Conv2d-105        [-1, 510, 112, 112]          48,960
          Conv2d-106        [-1, 510, 112, 112]           4,590
          Conv2d-107         [-1, 96, 112, 112]          24,480
     FeedForward-108         [-1, 96, 112, 112]               0
TransformerBlock-109         [-1, 96, 112, 112]               0
WithBias_LayerNorm-110            [-1, 12544, 96]             192
       LayerNorm-111         [-1, 96, 112, 112]               0
          Conv2d-112        [-1, 288, 112, 112]          27,648
          Conv2d-113        [-1, 288, 112, 112]           2,592
          Conv2d-114         [-1, 96, 112, 112]           9,216
       Attention-115         [-1, 96, 112, 112]               0
WithBias_LayerNorm-116            [-1, 12544, 96]             192
       LayerNorm-117         [-1, 96, 112, 112]               0
          Conv2d-118        [-1, 510, 112, 112]          48,960
          Conv2d-119        [-1, 510, 112, 112]           4,590
          Conv2d-120         [-1, 96, 112, 112]          24,480
     FeedForward-121         [-1, 96, 112, 112]               0
TransformerBlock-122         [-1, 96, 112, 112]               0
WithBias_LayerNorm-123            [-1, 12544, 96]             192
       LayerNorm-124         [-1, 96, 112, 112]               0
          Conv2d-125        [-1, 288, 112, 112]          27,648
          Conv2d-126        [-1, 288, 112, 112]           2,592
          Conv2d-127         [-1, 96, 112, 112]           9,216
       Attention-128         [-1, 96, 112, 112]               0
WithBias_LayerNorm-129            [-1, 12544, 96]             192
       LayerNorm-130         [-1, 96, 112, 112]               0
          Conv2d-131        [-1, 510, 112, 112]          48,960
          Conv2d-132        [-1, 510, 112, 112]           4,590
          Conv2d-133         [-1, 96, 112, 112]          24,480
     FeedForward-134         [-1, 96, 112, 112]               0
TransformerBlock-135         [-1, 96, 112, 112]               0
          Conv2d-136         [-1, 48, 112, 112]          41,472
  PixelUnshuffle-137          [-1, 192, 56, 56]               0
      Downsample-138          [-1, 192, 56, 56]               0
WithBias_LayerNorm-139            [-1, 3136, 192]             384
       LayerNorm-140          [-1, 192, 56, 56]               0
          Conv2d-141          [-1, 576, 56, 56]         110,592
          Conv2d-142          [-1, 576, 56, 56]           5,184
          Conv2d-143          [-1, 192, 56, 56]          36,864
       Attention-144          [-1, 192, 56, 56]               0
WithBias_LayerNorm-145            [-1, 3136, 192]             384
       LayerNorm-146          [-1, 192, 56, 56]               0
          Conv2d-147         [-1, 1020, 56, 56]         195,840
          Conv2d-148         [-1, 1020, 56, 56]           9,180
          Conv2d-149          [-1, 192, 56, 56]          97,920
     FeedForward-150          [-1, 192, 56, 56]               0
TransformerBlock-151          [-1, 192, 56, 56]               0
WithBias_LayerNorm-152            [-1, 3136, 192]             384
       LayerNorm-153          [-1, 192, 56, 56]               0
          Conv2d-154          [-1, 576, 56, 56]         110,592
          Conv2d-155          [-1, 576, 56, 56]           5,184
          Conv2d-156          [-1, 192, 56, 56]          36,864
       Attention-157          [-1, 192, 56, 56]               0
WithBias_LayerNorm-158            [-1, 3136, 192]             384
       LayerNorm-159          [-1, 192, 56, 56]               0
          Conv2d-160         [-1, 1020, 56, 56]         195,840
          Conv2d-161         [-1, 1020, 56, 56]           9,180
          Conv2d-162          [-1, 192, 56, 56]          97,920
     FeedForward-163          [-1, 192, 56, 56]               0
TransformerBlock-164          [-1, 192, 56, 56]               0
WithBias_LayerNorm-165            [-1, 3136, 192]             384
       LayerNorm-166          [-1, 192, 56, 56]               0
          Conv2d-167          [-1, 576, 56, 56]         110,592
          Conv2d-168          [-1, 576, 56, 56]           5,184
          Conv2d-169          [-1, 192, 56, 56]          36,864
       Attention-170          [-1, 192, 56, 56]               0
WithBias_LayerNorm-171            [-1, 3136, 192]             384
       LayerNorm-172          [-1, 192, 56, 56]               0
          Conv2d-173         [-1, 1020, 56, 56]         195,840
          Conv2d-174         [-1, 1020, 56, 56]           9,180
          Conv2d-175          [-1, 192, 56, 56]          97,920
     FeedForward-176          [-1, 192, 56, 56]               0
TransformerBlock-177          [-1, 192, 56, 56]               0
WithBias_LayerNorm-178            [-1, 3136, 192]             384
       LayerNorm-179          [-1, 192, 56, 56]               0
          Conv2d-180          [-1, 576, 56, 56]         110,592
          Conv2d-181          [-1, 576, 56, 56]           5,184
          Conv2d-182          [-1, 192, 56, 56]          36,864
       Attention-183          [-1, 192, 56, 56]               0
WithBias_LayerNorm-184            [-1, 3136, 192]             384
       LayerNorm-185          [-1, 192, 56, 56]               0
          Conv2d-186         [-1, 1020, 56, 56]         195,840
          Conv2d-187         [-1, 1020, 56, 56]           9,180
          Conv2d-188          [-1, 192, 56, 56]          97,920
     FeedForward-189          [-1, 192, 56, 56]               0
TransformerBlock-190          [-1, 192, 56, 56]               0
WithBias_LayerNorm-191            [-1, 3136, 192]             384
       LayerNorm-192          [-1, 192, 56, 56]               0
          Conv2d-193          [-1, 576, 56, 56]         110,592
          Conv2d-194          [-1, 576, 56, 56]           5,184
          Conv2d-195          [-1, 192, 56, 56]          36,864
       Attention-196          [-1, 192, 56, 56]               0
WithBias_LayerNorm-197            [-1, 3136, 192]             384
       LayerNorm-198          [-1, 192, 56, 56]               0
          Conv2d-199         [-1, 1020, 56, 56]         195,840
          Conv2d-200         [-1, 1020, 56, 56]           9,180
          Conv2d-201          [-1, 192, 56, 56]          97,920
     FeedForward-202          [-1, 192, 56, 56]               0
TransformerBlock-203          [-1, 192, 56, 56]               0
WithBias_LayerNorm-204            [-1, 3136, 192]             384
       LayerNorm-205          [-1, 192, 56, 56]               0
          Conv2d-206          [-1, 576, 56, 56]         110,592
          Conv2d-207          [-1, 576, 56, 56]           5,184
          Conv2d-208          [-1, 192, 56, 56]          36,864
       Attention-209          [-1, 192, 56, 56]               0
WithBias_LayerNorm-210            [-1, 3136, 192]             384
       LayerNorm-211          [-1, 192, 56, 56]               0
          Conv2d-212         [-1, 1020, 56, 56]         195,840
          Conv2d-213         [-1, 1020, 56, 56]           9,180
          Conv2d-214          [-1, 192, 56, 56]          97,920
     FeedForward-215          [-1, 192, 56, 56]               0
TransformerBlock-216          [-1, 192, 56, 56]               0
          Conv2d-217           [-1, 96, 56, 56]         165,888
  PixelUnshuffle-218          [-1, 384, 28, 28]               0
      Downsample-219          [-1, 384, 28, 28]               0
WithBias_LayerNorm-220             [-1, 784, 384]             768
       LayerNorm-221          [-1, 384, 28, 28]               0
          Conv2d-222         [-1, 1152, 28, 28]         442,368
          Conv2d-223         [-1, 1152, 28, 28]          10,368
          Conv2d-224          [-1, 384, 28, 28]         147,456
       Attention-225          [-1, 384, 28, 28]               0
WithBias_LayerNorm-226             [-1, 784, 384]             768
       LayerNorm-227          [-1, 384, 28, 28]               0
          Conv2d-228         [-1, 2042, 28, 28]         784,128
          Conv2d-229         [-1, 2042, 28, 28]          18,378
          Conv2d-230          [-1, 384, 28, 28]         392,064
     FeedForward-231          [-1, 384, 28, 28]               0
TransformerBlock-232          [-1, 384, 28, 28]               0
WithBias_LayerNorm-233             [-1, 784, 384]             768
       LayerNorm-234          [-1, 384, 28, 28]               0
          Conv2d-235         [-1, 1152, 28, 28]         442,368
          Conv2d-236         [-1, 1152, 28, 28]          10,368
          Conv2d-237          [-1, 384, 28, 28]         147,456
       Attention-238          [-1, 384, 28, 28]               0
WithBias_LayerNorm-239             [-1, 784, 384]             768
       LayerNorm-240          [-1, 384, 28, 28]               0
          Conv2d-241         [-1, 2042, 28, 28]         784,128
          Conv2d-242         [-1, 2042, 28, 28]          18,378
          Conv2d-243          [-1, 384, 28, 28]         392,064
     FeedForward-244          [-1, 384, 28, 28]               0
TransformerBlock-245          [-1, 384, 28, 28]               0
WithBias_LayerNorm-246             [-1, 784, 384]             768
       LayerNorm-247          [-1, 384, 28, 28]               0
          Conv2d-248         [-1, 1152, 28, 28]         442,368
          Conv2d-249         [-1, 1152, 28, 28]          10,368
          Conv2d-250          [-1, 384, 28, 28]         147,456
       Attention-251          [-1, 384, 28, 28]               0
WithBias_LayerNorm-252             [-1, 784, 384]             768
       LayerNorm-253          [-1, 384, 28, 28]               0
          Conv2d-254         [-1, 2042, 28, 28]         784,128
          Conv2d-255         [-1, 2042, 28, 28]          18,378
          Conv2d-256          [-1, 384, 28, 28]         392,064
     FeedForward-257          [-1, 384, 28, 28]               0
TransformerBlock-258          [-1, 384, 28, 28]               0
WithBias_LayerNorm-259             [-1, 784, 384]             768
       LayerNorm-260          [-1, 384, 28, 28]               0
          Conv2d-261         [-1, 1152, 28, 28]         442,368
          Conv2d-262         [-1, 1152, 28, 28]          10,368
          Conv2d-263          [-1, 384, 28, 28]         147,456
       Attention-264          [-1, 384, 28, 28]               0
WithBias_LayerNorm-265             [-1, 784, 384]             768
       LayerNorm-266          [-1, 384, 28, 28]               0
          Conv2d-267         [-1, 2042, 28, 28]         784,128
          Conv2d-268         [-1, 2042, 28, 28]          18,378
          Conv2d-269          [-1, 384, 28, 28]         392,064
     FeedForward-270          [-1, 384, 28, 28]               0
TransformerBlock-271          [-1, 384, 28, 28]               0
WithBias_LayerNorm-272             [-1, 784, 384]             768
       LayerNorm-273          [-1, 384, 28, 28]               0
          Conv2d-274         [-1, 1152, 28, 28]         442,368
          Conv2d-275         [-1, 1152, 28, 28]          10,368
          Conv2d-276          [-1, 384, 28, 28]         147,456
       Attention-277          [-1, 384, 28, 28]               0
WithBias_LayerNorm-278             [-1, 784, 384]             768
       LayerNorm-279          [-1, 384, 28, 28]               0
          Conv2d-280         [-1, 2042, 28, 28]         784,128
          Conv2d-281         [-1, 2042, 28, 28]          18,378
          Conv2d-282          [-1, 384, 28, 28]         392,064
     FeedForward-283          [-1, 384, 28, 28]               0
TransformerBlock-284          [-1, 384, 28, 28]               0
WithBias_LayerNorm-285             [-1, 784, 384]             768
       LayerNorm-286          [-1, 384, 28, 28]               0
          Conv2d-287         [-1, 1152, 28, 28]         442,368
          Conv2d-288         [-1, 1152, 28, 28]          10,368
          Conv2d-289          [-1, 384, 28, 28]         147,456
       Attention-290          [-1, 384, 28, 28]               0
WithBias_LayerNorm-291             [-1, 784, 384]             768
       LayerNorm-292          [-1, 384, 28, 28]               0
          Conv2d-293         [-1, 2042, 28, 28]         784,128
          Conv2d-294         [-1, 2042, 28, 28]          18,378
          Conv2d-295          [-1, 384, 28, 28]         392,064
     FeedForward-296          [-1, 384, 28, 28]               0
TransformerBlock-297          [-1, 384, 28, 28]               0
WithBias_LayerNorm-298             [-1, 784, 384]             768
       LayerNorm-299          [-1, 384, 28, 28]               0
          Conv2d-300         [-1, 1152, 28, 28]         442,368
          Conv2d-301         [-1, 1152, 28, 28]          10,368
          Conv2d-302          [-1, 384, 28, 28]         147,456
       Attention-303          [-1, 384, 28, 28]               0
WithBias_LayerNorm-304             [-1, 784, 384]             768
       LayerNorm-305          [-1, 384, 28, 28]               0
          Conv2d-306         [-1, 2042, 28, 28]         784,128
          Conv2d-307         [-1, 2042, 28, 28]          18,378
          Conv2d-308          [-1, 384, 28, 28]         392,064
     FeedForward-309          [-1, 384, 28, 28]               0
TransformerBlock-310          [-1, 384, 28, 28]               0
WithBias_LayerNorm-311             [-1, 784, 384]             768
       LayerNorm-312          [-1, 384, 28, 28]               0
          Conv2d-313         [-1, 1152, 28, 28]         442,368
          Conv2d-314         [-1, 1152, 28, 28]          10,368
          Conv2d-315          [-1, 384, 28, 28]         147,456
       Attention-316          [-1, 384, 28, 28]               0
WithBias_LayerNorm-317             [-1, 784, 384]             768
       LayerNorm-318          [-1, 384, 28, 28]               0
          Conv2d-319         [-1, 2042, 28, 28]         784,128
          Conv2d-320         [-1, 2042, 28, 28]          18,378
          Conv2d-321          [-1, 384, 28, 28]         392,064
     FeedForward-322          [-1, 384, 28, 28]               0
TransformerBlock-323          [-1, 384, 28, 28]               0
          Conv2d-324          [-1, 768, 28, 28]       2,654,208
    PixelShuffle-325          [-1, 192, 56, 56]               0
        Upsample-326          [-1, 192, 56, 56]               0
          Conv2d-327          [-1, 192, 56, 56]          73,728
WithBias_LayerNorm-328            [-1, 3136, 192]             384
       LayerNorm-329          [-1, 192, 56, 56]               0
          Conv2d-330          [-1, 576, 56, 56]         110,592
          Conv2d-331          [-1, 576, 56, 56]           5,184
          Conv2d-332          [-1, 192, 56, 56]          36,864
       Attention-333          [-1, 192, 56, 56]               0
WithBias_LayerNorm-334            [-1, 3136, 192]             384
       LayerNorm-335          [-1, 192, 56, 56]               0
          Conv2d-336         [-1, 1020, 56, 56]         195,840
          Conv2d-337         [-1, 1020, 56, 56]           9,180
          Conv2d-338          [-1, 192, 56, 56]          97,920
     FeedForward-339          [-1, 192, 56, 56]               0
TransformerBlock-340          [-1, 192, 56, 56]               0
WithBias_LayerNorm-341            [-1, 3136, 192]             384
       LayerNorm-342          [-1, 192, 56, 56]               0
          Conv2d-343          [-1, 576, 56, 56]         110,592
          Conv2d-344          [-1, 576, 56, 56]           5,184
          Conv2d-345          [-1, 192, 56, 56]          36,864
       Attention-346          [-1, 192, 56, 56]               0
WithBias_LayerNorm-347            [-1, 3136, 192]             384
       LayerNorm-348          [-1, 192, 56, 56]               0
          Conv2d-349         [-1, 1020, 56, 56]         195,840
          Conv2d-350         [-1, 1020, 56, 56]           9,180
          Conv2d-351          [-1, 192, 56, 56]          97,920
     FeedForward-352          [-1, 192, 56, 56]               0
TransformerBlock-353          [-1, 192, 56, 56]               0
WithBias_LayerNorm-354            [-1, 3136, 192]             384
       LayerNorm-355          [-1, 192, 56, 56]               0
          Conv2d-356          [-1, 576, 56, 56]         110,592
          Conv2d-357          [-1, 576, 56, 56]           5,184
          Conv2d-358          [-1, 192, 56, 56]          36,864
       Attention-359          [-1, 192, 56, 56]               0
WithBias_LayerNorm-360            [-1, 3136, 192]             384
       LayerNorm-361          [-1, 192, 56, 56]               0
          Conv2d-362         [-1, 1020, 56, 56]         195,840
          Conv2d-363         [-1, 1020, 56, 56]           9,180
          Conv2d-364          [-1, 192, 56, 56]          97,920
     FeedForward-365          [-1, 192, 56, 56]               0
TransformerBlock-366          [-1, 192, 56, 56]               0
WithBias_LayerNorm-367            [-1, 3136, 192]             384
       LayerNorm-368          [-1, 192, 56, 56]               0
          Conv2d-369          [-1, 576, 56, 56]         110,592
          Conv2d-370          [-1, 576, 56, 56]           5,184
          Conv2d-371          [-1, 192, 56, 56]          36,864
       Attention-372          [-1, 192, 56, 56]               0
WithBias_LayerNorm-373            [-1, 3136, 192]             384
       LayerNorm-374          [-1, 192, 56, 56]               0
          Conv2d-375         [-1, 1020, 56, 56]         195,840
          Conv2d-376         [-1, 1020, 56, 56]           9,180
          Conv2d-377          [-1, 192, 56, 56]          97,920
     FeedForward-378          [-1, 192, 56, 56]               0
TransformerBlock-379          [-1, 192, 56, 56]               0
WithBias_LayerNorm-380            [-1, 3136, 192]             384
       LayerNorm-381          [-1, 192, 56, 56]               0
          Conv2d-382          [-1, 576, 56, 56]         110,592
          Conv2d-383          [-1, 576, 56, 56]           5,184
          Conv2d-384          [-1, 192, 56, 56]          36,864
       Attention-385          [-1, 192, 56, 56]               0
WithBias_LayerNorm-386            [-1, 3136, 192]             384
       LayerNorm-387          [-1, 192, 56, 56]               0
          Conv2d-388         [-1, 1020, 56, 56]         195,840
          Conv2d-389         [-1, 1020, 56, 56]           9,180
          Conv2d-390          [-1, 192, 56, 56]          97,920
     FeedForward-391          [-1, 192, 56, 56]               0
TransformerBlock-392          [-1, 192, 56, 56]               0
WithBias_LayerNorm-393            [-1, 3136, 192]             384
       LayerNorm-394          [-1, 192, 56, 56]               0
          Conv2d-395          [-1, 576, 56, 56]         110,592
          Conv2d-396          [-1, 576, 56, 56]           5,184
          Conv2d-397          [-1, 192, 56, 56]          36,864
       Attention-398          [-1, 192, 56, 56]               0
WithBias_LayerNorm-399            [-1, 3136, 192]             384
       LayerNorm-400          [-1, 192, 56, 56]               0
          Conv2d-401         [-1, 1020, 56, 56]         195,840
          Conv2d-402         [-1, 1020, 56, 56]           9,180
          Conv2d-403          [-1, 192, 56, 56]          97,920
     FeedForward-404          [-1, 192, 56, 56]               0
TransformerBlock-405          [-1, 192, 56, 56]               0
          Conv2d-406          [-1, 384, 56, 56]         663,552
    PixelShuffle-407         [-1, 96, 112, 112]               0
        Upsample-408         [-1, 96, 112, 112]               0
          Conv2d-409         [-1, 96, 112, 112]          18,432
WithBias_LayerNorm-410            [-1, 12544, 96]             192
       LayerNorm-411         [-1, 96, 112, 112]               0
          Conv2d-412        [-1, 288, 112, 112]          27,648
          Conv2d-413        [-1, 288, 112, 112]           2,592
          Conv2d-414         [-1, 96, 112, 112]           9,216
       Attention-415         [-1, 96, 112, 112]               0
WithBias_LayerNorm-416            [-1, 12544, 96]             192
       LayerNorm-417         [-1, 96, 112, 112]               0
          Conv2d-418        [-1, 510, 112, 112]          48,960
          Conv2d-419        [-1, 510, 112, 112]           4,590
          Conv2d-420         [-1, 96, 112, 112]          24,480
     FeedForward-421         [-1, 96, 112, 112]               0
TransformerBlock-422         [-1, 96, 112, 112]               0
WithBias_LayerNorm-423            [-1, 12544, 96]             192
       LayerNorm-424         [-1, 96, 112, 112]               0
          Conv2d-425        [-1, 288, 112, 112]          27,648
          Conv2d-426        [-1, 288, 112, 112]           2,592
          Conv2d-427         [-1, 96, 112, 112]           9,216
       Attention-428         [-1, 96, 112, 112]               0
WithBias_LayerNorm-429            [-1, 12544, 96]             192
       LayerNorm-430         [-1, 96, 112, 112]               0
          Conv2d-431        [-1, 510, 112, 112]          48,960
          Conv2d-432        [-1, 510, 112, 112]           4,590
          Conv2d-433         [-1, 96, 112, 112]          24,480
     FeedForward-434         [-1, 96, 112, 112]               0
TransformerBlock-435         [-1, 96, 112, 112]               0
WithBias_LayerNorm-436            [-1, 12544, 96]             192
       LayerNorm-437         [-1, 96, 112, 112]               0
          Conv2d-438        [-1, 288, 112, 112]          27,648
          Conv2d-439        [-1, 288, 112, 112]           2,592
          Conv2d-440         [-1, 96, 112, 112]           9,216
       Attention-441         [-1, 96, 112, 112]               0
WithBias_LayerNorm-442            [-1, 12544, 96]             192
       LayerNorm-443         [-1, 96, 112, 112]               0
          Conv2d-444        [-1, 510, 112, 112]          48,960
          Conv2d-445        [-1, 510, 112, 112]           4,590
          Conv2d-446         [-1, 96, 112, 112]          24,480
     FeedForward-447         [-1, 96, 112, 112]               0
TransformerBlock-448         [-1, 96, 112, 112]               0
WithBias_LayerNorm-449            [-1, 12544, 96]             192
       LayerNorm-450         [-1, 96, 112, 112]               0
          Conv2d-451        [-1, 288, 112, 112]          27,648
          Conv2d-452        [-1, 288, 112, 112]           2,592
          Conv2d-453         [-1, 96, 112, 112]           9,216
       Attention-454         [-1, 96, 112, 112]               0
WithBias_LayerNorm-455            [-1, 12544, 96]             192
       LayerNorm-456         [-1, 96, 112, 112]               0
          Conv2d-457        [-1, 510, 112, 112]          48,960
          Conv2d-458        [-1, 510, 112, 112]           4,590
          Conv2d-459         [-1, 96, 112, 112]          24,480
     FeedForward-460         [-1, 96, 112, 112]               0
TransformerBlock-461         [-1, 96, 112, 112]               0
WithBias_LayerNorm-462            [-1, 12544, 96]             192
       LayerNorm-463         [-1, 96, 112, 112]               0
          Conv2d-464        [-1, 288, 112, 112]          27,648
          Conv2d-465        [-1, 288, 112, 112]           2,592
          Conv2d-466         [-1, 96, 112, 112]           9,216
       Attention-467         [-1, 96, 112, 112]               0
WithBias_LayerNorm-468            [-1, 12544, 96]             192
       LayerNorm-469         [-1, 96, 112, 112]               0
          Conv2d-470        [-1, 510, 112, 112]          48,960
          Conv2d-471        [-1, 510, 112, 112]           4,590
          Conv2d-472         [-1, 96, 112, 112]          24,480
     FeedForward-473         [-1, 96, 112, 112]               0
TransformerBlock-474         [-1, 96, 112, 112]               0
WithBias_LayerNorm-475            [-1, 12544, 96]             192
       LayerNorm-476         [-1, 96, 112, 112]               0
          Conv2d-477        [-1, 288, 112, 112]          27,648
          Conv2d-478        [-1, 288, 112, 112]           2,592
          Conv2d-479         [-1, 96, 112, 112]           9,216
       Attention-480         [-1, 96, 112, 112]               0
WithBias_LayerNorm-481            [-1, 12544, 96]             192
       LayerNorm-482         [-1, 96, 112, 112]               0
          Conv2d-483        [-1, 510, 112, 112]          48,960
          Conv2d-484        [-1, 510, 112, 112]           4,590
          Conv2d-485         [-1, 96, 112, 112]          24,480
     FeedForward-486         [-1, 96, 112, 112]               0
TransformerBlock-487         [-1, 96, 112, 112]               0
          Conv2d-488        [-1, 192, 112, 112]         165,888
    PixelShuffle-489         [-1, 48, 224, 224]               0
        Upsample-490         [-1, 48, 224, 224]               0
WithBias_LayerNorm-491            [-1, 50176, 96]             192
       LayerNorm-492         [-1, 96, 224, 224]               0
          Conv2d-493        [-1, 288, 224, 224]          27,648
          Conv2d-494        [-1, 288, 224, 224]           2,592
          Conv2d-495         [-1, 96, 224, 224]           9,216
       Attention-496         [-1, 96, 224, 224]               0
WithBias_LayerNorm-497            [-1, 50176, 96]             192
       LayerNorm-498         [-1, 96, 224, 224]               0
          Conv2d-499        [-1, 510, 224, 224]          48,960
          Conv2d-500        [-1, 510, 224, 224]           4,590
          Conv2d-501         [-1, 96, 224, 224]          24,480
     FeedForward-502         [-1, 96, 224, 224]               0
TransformerBlock-503         [-1, 96, 224, 224]               0
WithBias_LayerNorm-504            [-1, 50176, 96]             192
       LayerNorm-505         [-1, 96, 224, 224]               0
          Conv2d-506        [-1, 288, 224, 224]          27,648
          Conv2d-507        [-1, 288, 224, 224]           2,592
          Conv2d-508         [-1, 96, 224, 224]           9,216
       Attention-509         [-1, 96, 224, 224]               0
WithBias_LayerNorm-510            [-1, 50176, 96]             192
       LayerNorm-511         [-1, 96, 224, 224]               0
          Conv2d-512        [-1, 510, 224, 224]          48,960
          Conv2d-513        [-1, 510, 224, 224]           4,590
          Conv2d-514         [-1, 96, 224, 224]          24,480
     FeedForward-515         [-1, 96, 224, 224]               0
TransformerBlock-516         [-1, 96, 224, 224]               0
WithBias_LayerNorm-517            [-1, 50176, 96]             192
       LayerNorm-518         [-1, 96, 224, 224]               0
          Conv2d-519        [-1, 288, 224, 224]          27,648
          Conv2d-520        [-1, 288, 224, 224]           2,592
          Conv2d-521         [-1, 96, 224, 224]           9,216
       Attention-522         [-1, 96, 224, 224]               0
WithBias_LayerNorm-523            [-1, 50176, 96]             192
       LayerNorm-524         [-1, 96, 224, 224]               0
          Conv2d-525        [-1, 510, 224, 224]          48,960
          Conv2d-526        [-1, 510, 224, 224]           4,590
          Conv2d-527         [-1, 96, 224, 224]          24,480
     FeedForward-528         [-1, 96, 224, 224]               0
TransformerBlock-529         [-1, 96, 224, 224]               0
WithBias_LayerNorm-530            [-1, 50176, 96]             192
       LayerNorm-531         [-1, 96, 224, 224]               0
          Conv2d-532        [-1, 288, 224, 224]          27,648
          Conv2d-533        [-1, 288, 224, 224]           2,592
          Conv2d-534         [-1, 96, 224, 224]           9,216
       Attention-535         [-1, 96, 224, 224]               0
WithBias_LayerNorm-536            [-1, 50176, 96]             192
       LayerNorm-537         [-1, 96, 224, 224]               0
          Conv2d-538        [-1, 510, 224, 224]          48,960
          Conv2d-539        [-1, 510, 224, 224]           4,590
          Conv2d-540         [-1, 96, 224, 224]          24,480
     FeedForward-541         [-1, 96, 224, 224]               0
TransformerBlock-542         [-1, 96, 224, 224]               0
WithBias_LayerNorm-543            [-1, 50176, 96]             192
       LayerNorm-544         [-1, 96, 224, 224]               0
          Conv2d-545        [-1, 288, 224, 224]          27,648
          Conv2d-546        [-1, 288, 224, 224]           2,592
          Conv2d-547         [-1, 96, 224, 224]           9,216
       Attention-548         [-1, 96, 224, 224]               0
WithBias_LayerNorm-549            [-1, 50176, 96]             192
       LayerNorm-550         [-1, 96, 224, 224]               0
          Conv2d-551        [-1, 510, 224, 224]          48,960
          Conv2d-552        [-1, 510, 224, 224]           4,590
          Conv2d-553         [-1, 96, 224, 224]          24,480
     FeedForward-554         [-1, 96, 224, 224]               0
TransformerBlock-555         [-1, 96, 224, 224]               0
WithBias_LayerNorm-556            [-1, 50176, 96]             192
       LayerNorm-557         [-1, 96, 224, 224]               0
          Conv2d-558        [-1, 288, 224, 224]          27,648
          Conv2d-559        [-1, 288, 224, 224]           2,592
          Conv2d-560         [-1, 96, 224, 224]           9,216
       Attention-561         [-1, 96, 224, 224]               0
WithBias_LayerNorm-562            [-1, 50176, 96]             192
       LayerNorm-563         [-1, 96, 224, 224]               0
          Conv2d-564        [-1, 510, 224, 224]          48,960
          Conv2d-565        [-1, 510, 224, 224]           4,590
          Conv2d-566         [-1, 96, 224, 224]          24,480
     FeedForward-567         [-1, 96, 224, 224]               0
TransformerBlock-568         [-1, 96, 224, 224]               0
WithBias_LayerNorm-569            [-1, 50176, 96]             192
       LayerNorm-570         [-1, 96, 224, 224]               0
          Conv2d-571        [-1, 288, 224, 224]          27,648
          Conv2d-572        [-1, 288, 224, 224]           2,592
          Conv2d-573         [-1, 96, 224, 224]           9,216
       Attention-574         [-1, 96, 224, 224]               0
WithBias_LayerNorm-575            [-1, 50176, 96]             192
       LayerNorm-576         [-1, 96, 224, 224]               0
          Conv2d-577        [-1, 510, 224, 224]          48,960
          Conv2d-578        [-1, 510, 224, 224]           4,590
          Conv2d-579         [-1, 96, 224, 224]          24,480
     FeedForward-580         [-1, 96, 224, 224]               0
TransformerBlock-581         [-1, 96, 224, 224]               0
WithBias_LayerNorm-582            [-1, 50176, 96]             192
       LayerNorm-583         [-1, 96, 224, 224]               0
          Conv2d-584        [-1, 288, 224, 224]          27,648
          Conv2d-585        [-1, 288, 224, 224]           2,592
          Conv2d-586         [-1, 96, 224, 224]           9,216
       Attention-587         [-1, 96, 224, 224]               0
WithBias_LayerNorm-588            [-1, 50176, 96]             192
       LayerNorm-589         [-1, 96, 224, 224]               0
          Conv2d-590        [-1, 510, 224, 224]          48,960
          Conv2d-591        [-1, 510, 224, 224]           4,590
          Conv2d-592         [-1, 96, 224, 224]          24,480
     FeedForward-593         [-1, 96, 224, 224]               0
TransformerBlock-594         [-1, 96, 224, 224]               0
          Conv2d-595          [-1, 3, 224, 224]           2,592
================================================================
Total params: 26,126,496
Trainable params: 26,126,496
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 14319.29
Params size (MB): 99.66
Estimated Total Size (MB): 14419.53
----------------------------------------------------------------
